#### Terraform Plan ✅
```
null_resource.unity_catalog_s3_self_trust: Refreshing state... [id=1460105122071027089]
data.aws_caller_identity.current: Reading...
aws_iam_user.streamlit_reader: Refreshing state... [id=property-data-platform-streamlit]
aws_iam_role_policy.unity_catalog_s3: Refreshing state... [id=property-data-platform-uc-storage:property-data-platform-s3-access]
aws_iam_role.unity_catalog_s3: Refreshing state... [id=property-data-platform-uc-storage]
data.aws_caller_identity.current: Read complete after 0s [id=517574620103]
aws_s3_bucket.delta_lake: Refreshing state... [id=property-data-platform-517574620103]
aws_iam_access_key.streamlit_reader: Refreshing state... [id=AKIAXRAOZ6PD4YLYJKM2]
aws_iam_user_policy.streamlit_reader: Refreshing state... [id=property-data-platform-streamlit:property-data-platform-s3-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_glue_catalog_database.property_data will be created
  + resource "aws_glue_catalog_database" "property_data" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "property_data"
      + tags_all     = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_job.gold will be created
  + resource "aws_glue_job" "gold" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--catalog_database"        = "property_data"
          + "--datalake-formats"        = "iceberg"
          + "--enable-glue-datacatalog" = "true"
        }
      + glue_version      = "5.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "property-data-platform-gold"
      + number_of_workers = 2
      + role_arn          = (known after apply)
      + tags_all          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
      + timeout           = 30
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://property-data-platform-517574620103/glue-scripts/gold.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.ingest will be created
  + resource "aws_glue_job" "ingest" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--additional-python-modules" = "requests,beautifulsoup4,yfinance,pandas,s3fs"
          + "--enable-job-insights"       = "false"
          + "--extra-py-files"            = "s3://property-data-platform-517574620103/glue-scripts/shared.zip"
          + "--landing_path"              = "s3://property-data-platform-517574620103/landing"
          + "--secret_name"               = "property-data-platform/GOOGLEMAPS_API_KEY"
        }
      + glue_version      = (known after apply)
      + id                = (known after apply)
      + max_capacity      = 0.0625
      + name              = "property-data-platform-ingest"
      + number_of_workers = (known after apply)
      + role_arn          = (known after apply)
      + tags_all          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
      + timeout           = 30
      + worker_type       = (known after apply)

      + command {
          + name            = "pythonshell"
          + python_version  = "3.9"
          + runtime         = (known after apply)
          + script_location = "s3://property-data-platform-517574620103/glue-scripts/ingest.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.silver will be created
  + resource "aws_glue_job" "silver" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--catalog_database"        = "property_data"
          + "--conf"                    = "spark.sql.extensions=org.apache.iceberg.spark.extensions.IcebergSparkSessionExtensions --conf spark.sql.catalog.glue_catalog=org.apache.iceberg.spark.SparkCatalog --conf spark.sql.catalog.glue_catalog.warehouse=s3://property-data-platform-517574620103/iceberg --conf spark.sql.catalog.glue_catalog.type=glue"
          + "--datalake-formats"        = "iceberg"
          + "--enable-glue-datacatalog" = "true"
          + "--job-bookmark-option"     = "job-bookmark-enable"
          + "--landing_path"            = "s3://property-data-platform-517574620103/landing"
        }
      + glue_version      = "5.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "property-data-platform-silver"
      + number_of_workers = 2
      + role_arn          = (known after apply)
      + tags_all          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
      + timeout           = 30
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://property-data-platform-517574620103/glue-scripts/silver.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_trigger.gold_after_silver will be created
  + resource "aws_glue_trigger" "gold_after_silver" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "property-data-platform-gold-trigger"
      + state         = (known after apply)
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
      + type          = "CONDITIONAL"
      + workflow_name = "property-data-platform"

      + actions {
          + job_name = "property-data-platform-gold"
        }

      + predicate {
          + logical = "AND"

          + conditions {
              + job_name         = "property-data-platform-silver"
              + logical_operator = "EQUALS"
              + state            = "SUCCEEDED"
            }
        }
    }

  # aws_glue_trigger.ingest_schedule will be created
  + resource "aws_glue_trigger" "ingest_schedule" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "property-data-platform-schedule"
      + schedule      = "cron(0 7 ? * MON *)"
      + state         = (known after apply)
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
      + type          = "SCHEDULED"
      + workflow_name = "property-data-platform"

      + actions {
          + job_name = "property-data-platform-ingest"
        }
    }

  # aws_glue_trigger.silver_after_ingest will be created
  + resource "aws_glue_trigger" "silver_after_ingest" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "property-data-platform-silver-trigger"
      + state         = (known after apply)
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
      + type          = "CONDITIONAL"
      + workflow_name = "property-data-platform"

      + actions {
          + job_name = "property-data-platform-silver"
        }

      + predicate {
          + logical = "AND"

          + conditions {
              + job_name         = "property-data-platform-ingest"
              + logical_operator = "EQUALS"
              + state            = "SUCCEEDED"
            }
        }
    }

  # aws_glue_workflow.pipeline will be created
  + resource "aws_glue_workflow" "pipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "property-data-platform"
      + tags_all = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
    }

  # aws_iam_role.glue_execution will be created
  + resource "aws_iam_role" "glue_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "property-data-platform-glue"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.unity_catalog_s3 will be destroyed
  # (because aws_iam_role.unity_catalog_s3 is not in configuration)
  - resource "aws_iam_role" "unity_catalog_s3" {
      - arn                   = "arn:aws:iam::517574620103:role/property-data-platform-uc-storage" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - StringEquals = {
                              - "sts:ExternalId" = "99bf1d00-c0cc-468a-a5a3-cd0ad40b37ea"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::414351767826:root"
                        }
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::517574620103:role/property-data-platform-uc-storage"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2026-03-21T20:15:31Z" -> null
      - force_detach_policies = false -> null
      - id                    = "property-data-platform-uc-storage" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "property-data-platform-uc-storage" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "ManagedBy" = "terraform"
          - "Project"   = "property-data-platform"
          - "Repo"      = "jonathangosling/property-data-platform"
        } -> null
      - unique_id             = "AROAXRAOZ6PDQOFPQHEIH" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "property-data-platform-s3-access" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:GetObject",
                              - "s3:PutObject",
                              - "s3:DeleteObject",
                              - "s3:ListBucket",
                              - "s3:GetBucketLocation",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::property-data-platform-517574620103",
                              - "arn:aws:s3:::property-data-platform-517574620103/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.glue_s3_access will be created
  + resource "aws_iam_role_policy" "glue_s3_access" {
      + id          = (known after apply)
      + name        = "property-data-platform-glue-s3"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:ListBucket",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::property-data-platform-517574620103",
                          + "arn:aws:s3:::property-data-platform-517574620103/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.glue_secrets_access will be created
  + resource "aws_iam_role_policy" "glue_secrets_access" {
      + id          = (known after apply)
      + name        = "property-data-platform-glue-secrets"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.unity_catalog_s3 will be destroyed
  # (because aws_iam_role_policy.unity_catalog_s3 is not in configuration)
  - resource "aws_iam_role_policy" "unity_catalog_s3" {
      - id          = "property-data-platform-uc-storage:property-data-platform-s3-access" -> null
      - name        = "property-data-platform-s3-access" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::property-data-platform-517574620103",
                          - "arn:aws:s3:::property-data-platform-517574620103/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "property-data-platform-uc-storage" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.glue_service will be created
  + resource "aws_iam_role_policy_attachment" "glue_service" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "property-data-platform-glue"
    }

  # aws_iam_user_policy.streamlit_reader will be updated in-place
  ~ resource "aws_iam_user_policy" "streamlit_reader" {
        id          = "property-data-platform-streamlit:property-data-platform-s3-read"
        name        = "property-data-platform-s3-read"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            "arn:aws:s3:::property-data-platform-517574620103",
                          ~ "arn:aws:s3:::property-data-platform-517574620103/delta/gold_*" -> "arn:aws:s3:::property-data-platform-517574620103/iceberg/gold_*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.googlemaps_api_key will be created
  + resource "aws_secretsmanager_secret" "googlemaps_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "property-data-platform/GOOGLEMAPS_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Project"   = "property-data-platform"
          + "Repo"      = "jonathangosling/property-data-platform"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.googlemaps_api_key will be created
  + resource "aws_secretsmanager_secret_version" "googlemaps_api_key" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # null_resource.unity_catalog_s3_self_trust will be destroyed
  # (because null_resource.unity_catalog_s3_self_trust is not in configuration)
  - resource "null_resource" "unity_catalog_s3_self_trust" {
      - id       = "1460105122071027089" -> null
      - triggers = {
          - "role_arn" = "arn:aws:iam::517574620103:role/property-data-platform-uc-storage"
        } -> null
    }

Plan: 14 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  - delta_lake_bucket           = "property-data-platform-517574620103" -> null
  + s3_bucket                   = "property-data-platform-517574620103"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```